export class TilesThemes {
  static readonly DEFAULT: number[][] = [
    [229, 15, 1], // Красный
    [53, 248, 28], // Зелёный
    [2, 87, 250], // Синий
    [248, 226, 21], // Жёлтый
    [255, 0, 255], // Фиолетовый
    [128, 255, 255], // Голубой
    [255, 255, 255], // Белый
  ];

  static readonly BLISS: number[][] = [
    [225, 165, 143],
    [212, 99, 89],
    [194, 202, 214],
    [238, 209, 202],
    [118, 143, 190],
    [159, 184, 219],
  ];

  static readonly VINTAGE: number[][] = [
    [216, 152, 102],
    [107, 107, 72],
    [206, 72, 50],
    [223, 204, 178],
    [233, 169, 61],
    [108, 42, 53],
  ];

  static readonly CANDY: number[][] = [
    [194, 239, 245],
    [61, 230, 230],
    [101, 166, 244],
    [244, 221, 244],
    [238, 159, 201],
    [245, 91, 235],
  ];
}
